package Practice;

public class MainPractice {

    /*
    Сотрудники банка выдают кредиты. У каждого из них есть диапазон по времени - максимальное время и минимальное
    время которое требуется для оформления кредита (minTime, maxTime). Но среди них есть сотрудник/сотрудники,
    у которых выросла работоспособность - они выдают кредиты быстрее, затем скорость может снижаться до обычной.
    Нужно посчитать время, за которое каждый сотрудник выдаст N - кредитов.


    1. создать классы:
    - абстрактный класс AbstractClerk
    - дочерние классы RegularClerc, LazyInspiredClerk

    2. Должна быть возможность на основе классов создавать потоки. Родительский класс должен реализовывать Runnable
     */
}
